
// შექმენით რიცხვების მასივი, სადაც გექნებაათ 10 რიცხვი, გამოიყენეთ map მეთოდი,
//  და გააკეთეთ ესეთი რამ, თუ ინდექსი არის ლუწი მაშინ ამჟამინდელი რიცხვი
//  გაამრავლეთ 2 ზე ხოლო თუ არის კენტი მაშინ დააბრუნეთ ხელშეუხებლად ამჟამინდელი რიცხვი, შემდეგ კი
//  იგივე რამე გააკეთეთ თქვენი კლონი მეთოდით ახსენით დეტალურად თქვენი კლონი კომენტარებით 

const numbers = [50,60,25,35,65,23,43,44,67,89];


const map = numbers.map((number,index) =>{
    if(index % 2 === 0){
        return number * 2
    }else{
        return number
    }
})

console.log(map)




// პირველ რიგში შევქმენით კონსტანტა სახელად myMap და შევქმენით arrow ფუნქციის საშუალებით  ფუნქცია რომელსაც არგუმენტად
// გადავეცით arr და func ანუ მასივი და რაღაც ფუნქცია რომელსაც მოგვიანებით გადავცემთ პარამეტრებს arr[i] და i  ანუ მასივის
// მნიშვნელობა და ინდექსი.შევქმენით შიგნით სიაც რომელშიც დავამეტებთ უკვე ტრანსფორმირებულ ელემენტებს
const myMap = ((arr,func) =>{
    let result = [];

    for(let i = 0; i < arr.length; i++){
        const transformedValue = func(arr[i],i)
        result.push(transformedValue)
    }
    return result
})


// შევქმენით filter კონტანტა რომელსაც გადავეცით myMap ფუნქცია და შევამოწმეთ პირობაზე დაყრდნობით თუ მნიშვნელობის ინდექსი იქნებოდა ლუწი
//  დაგვებრუნებინა მნიშვნელობა გამრავლებული ორზე,ხოლო თუ ინდექსი კენტია დაგვებრუნებინა ხელშეუხებლად ელემენტი
const filter = myMap(numbers,(number,index) => {
    if(index % 2 === 0){
        return number * 2
    }else{
        return number
    }
})

console.log(filter)


