// 1) შექმენით მაგალითები var, let, const ახსენით მათ შორის 
// სრული განსხვავება, აგრეთვე ახსენით რა არის გლობალური, ლოკალური
// (ანუ ფუნქციის) და ბლოკის ფარგლები, რა განსხვავებაა მათ შორის, აგრეთვე 
// დაწერეთ მაგალითუი სადაც
//  მუშაობს ლექსიკური ფარგლები და ახსენით რა არის ის



// var keywordის დახმარებით შევქმენით ცვლადი რომლის სახელიცაა name ხოლო 
// მნიშვნელობად გადავეცით "Giorgi"
var name = "Giorgi";


// let  keyword ის დახმარებით შევქმენით ცვლადი სახელად lastname რომელსაც
//  გადავეცით მნიშვნელობა "Khmaladze"
let lastname = "Khmaladze";


// const keyword ის დახმარებით შევქმენით კონსტანტა სახელად age რომელსაც გადავეცით მნიშვნელობად age
const age = 17;


//თითოეული keyword_ში არის განსხვავება var keyword ით შექმნილი ცვლადი დანარჩენებისგან განსხვავდება იმით რომ
//var ს აქვს გლობალური scope  რაც ნიშნავს იმას რომ var keyword ით შექმნილი ცვლადი პირდაპირ ინახება window "უჯრაში" 
//სადაც მოქცეულია დოკუმენტის ყველა ობიექტი. var ს ასევე არ გააჩნია ბლოკის ფარგლები ანუ კოდის ბლოკში შექმნილი ცვლადები შეგვიძლია გამოვიყენოთ
// კოდის ბლოკის გარეთაც 



// const არის კონსტანტა რომელსაც var ისგან განსხვავებით არ გააჩნია გლობალური ფარგლები,გააჩნია ბლოკის ფარგლები 
// და ასევე var_ისგან გასხვავდება იმით რომ კონსტანტა არის მუდმივი ცვლადი ანუ ერთხელ როდესაც შევქმნით აღარ შეგვიძლია მისი შეცვლა 



// ლექსიკური ფარგლები ნიშნავს იმას რომ ჩვენ გვაქვს წვდომა კოდის ბლოკში სხვა ნებისმიერ ცვლადზე
const height = 16;
function printInfo(){
    const weight = 65;
    function print(){
        console.log(height,weight)
    }
    print()
}

printInfo()

 
