#simple pig latin

#შევქმენით ფუნქცია სახელად pig_it რომელსაც პარამეტრად გადავეცით text სადაც შევა სტრინგ ტიპის მონაცემი
def pig_it(text):

    # შემდეგ შევქმენით ცვლადი სახელად symbols სადაც გადავეცით სიმბოლოები
    symbols = "!@#$%?"

    #შემდეგ შევქმენით ახალი  ცვლადი words_list რომელშიც გავხლიჩეთ split მეთოდის გამოყენებით ტექსტი ყოველ სფეისსზე რადგან პირობის მიხედვით ისე უნდა გაგვეკეთებინა რომ სტრინგის ყოველი სიტყვის პირველი ასო უნდა გადაგვეტანა იმავე სიტყვის ბოლოში,ხოლო როდესაც უკვე ტექსტს გავხლიჩავთ და უკვე სიად გადავაქცევთ ამის გაკეთება გაგვიმარტივდება
    words_list = text.split(" ")

    #გავაკეთეთ ცარიელი სია სადაც ჩავამატებთ პირობის მიხედვით უკვე გადაკეთებულ სიტყვებს
    result = []

    #გავაკეთეთ სიაზე გადავლა და შევქმენით საიტერაციო ცვლადი სახელად word
    for word in words_list:

        #თუ word საიტერაციო ცვლადი არ შედის symbols ცვლადში ანუ თუ word არ არის სიმბოლო ვამატებთ result სიაში append მეთოდის გამოყენებით. პირობის მიხედვით გადაკეთებულ სიტყვას პირობაში ისიც ეწერა რომ ყოველ გადაკეთებულ სიტყვას ბოლოში უნდა დავუმატოთ "ay"
        if word not in symbols:
            
            #დავამატეთ result სიაში გადაკეთებული სიტყვა
            result.append(word[1:] + word[0] + "ay")
        
        #სხვა შემთხვევაში თუ words_list-ის რომელიმე სიტყვა ან ასო არის სიმბოლო ვამატებთ პირდაპირ result სიაში 
        else:
            result.append(word)

    
    return " ".join(result)
