#does my number look big in this 

#შევქმენით ფუნცია სახელად narcissistic რომელსაც პარამეტრად გადავეცით value სადაც შევა ინტეჯერ ტიპის მონაცემი
def narcissistic( value ):

    # შემდეგ შევქმენით ცვლადი სახელად str_value რომელსაც გადავეცით მნიშვნელობად ფუნქცისს პარამეტრი ოღონდ სტრინგ ტიპად გადაქცეული,რადგან მოვახდინოთ მასზე იტერაცია
    str_value = str(value)

    #შევქმენით ცვლადი სახელად digit_count რომელსაც გადავეცით მნიშვნელობად str_value-ს სიგრძე
    digit_count = len(str_value)

    #შემდეგ შევქმენით sum ცვლადი რადგან ჩვენ გვინდა რომ ასევე გამოვთვალოთ ჯამი მოცემული რიცხვების
    sum = 0

    #დავატრიალეთ for ციკლი და გადავუარეთ str_valueს 
    for i in str_value:

        #sum ცვლადს დავუმატეთ პარამეტრში მოცემული თითოეული რიცხვი და ავახარისხეთ
        sum += int(i) ** digit_count

    #ბოლოს კი დავაბრუნეთ boolean უდრიდა თუ არა ნამდვილად sum ცვლადი value პარამეტრს
    return sum == value