//შექმენით თქვენი დაპირება, მეგობარმა თუ არ მოგიტანათ წიგნი დააბრუნეთ რეჯექტით რომ წიგნი ვერ მიიღეთ, ხოლო თუ პირობა შესრულდა მაგ შემთხვევაში დააბრუნეთ რომ წიგნი წარმატებით მიიღეთ (კომენტარებით ახსენით დეტალურად ყველაფერი) რა არის Promise, the, and catch



//promise რომ გადავთარგმნოთ არის ნდობა, ჯავასკრიპტსი promise დამოკიდებულია ჩვენს პირობაზე თუ როგორ შესრულდება,იმის შემდეგ შესაბამის მოქმედებას მოახდენს
    //then შეგვიზლია გამოვიყენოთ იმის შემდეგ როდესაც ჩვენი promise 
    //წარმატებით შესრულდება 
    const promise = new Promise((resolve,reject)=>{
        const friend = false;
        if(friend){
            resolve("book delivered succesfully!")
        }else{
            reject("book not delivered")
        }
    })