// შექმენით ფუნქცია სახელად manualFilter რომელსაც პირველი გადაეცემა ფუნქცია და მეორე მასივი, 
// ამ ფუნქციაში უნდა გამოიყენოთ for ციკლი და გადაუარეთ გადმოცემულ მასივს, 
// გამოიყენეთ if და გამოიძახეთ გადმოცემული ფუნქცია ამჟამინდელ ინდექსზე მდგომი მნიშნელობით,
//  თუ დაბრუნებული მნიშნელობა არის true დაამატეთ ახალ მასივში და თუ არის false არ დაამატოთ 
// ახალ მასივში, როცა მორჩება for ციკლის მუშაობა დააბრუნეთ ახალი მასივი=, გადაცემული
//  ფუნქციიდან აუცილებლად უნდა ბრუნდებოეს boolean მნიშვნელობა, და უნდა იღებდეს ერთ 
// მნიშნელობას გადაცემულ ფუნქციაში რას შეამოწმებთ თქვენზეა დამოკიდებული



function manualFilter(func, arr){
    let filteredArray = []
    for(let i = 0; i < arr.length; i++){
        if(func(arr[i])){
            filteredArray.push(arr[i])
        }
    }

    return filteredArray
}

function isPositive(number){
    if(number > 0){
        return number
    }
}


console.log(manualFilter(isPositive,[-1,3,-2,36,7]))