let name = prompt("Enter your name");

let user = {
    [name]: true,
}


alert(user[name])




let usr = {
    name:"Giorgi",
    age:17,
}

alert("name" in usr)

for(let key in usr){
    console.log(key)
    console.log(usr[key])
}

// ობიექტები არის მასივები რომლებსაც გააჩნიათ განსაკუთრებული თვისებები
// ობიექტს გააჩნია კუთვნილებები მაგალითად name, age და ა.შ, ამ კუთვნილებებს კი გააჩნიათ
// მნიშვნელობები.კუთვნილების სახელი უნდა იყოს სტრინგი ხოლო მნიშვნელობა შეიძლება იყოს 
// ყველა მონაცემთა ტიპის მნიშვნელობა.
// კუთვნილებას რომ მივწვდეთ შეგვიძლია გავაკეთოთ ასე: objectName.property და შეგვიძლია მივწვდეთ 
// კვადრატული ფრჩხილების საშუალებით მაგალითად ასე objectName[property]
// შეგვიძლია წავშალოთ კუთვნილებაც მაგალითად აი ასე: delete objectName.property
// შეგვიძლია შევამოწმოთ არსებობს თუ არა კონკრეტული კუთვნილება მოცემულ
// ობიექტში property in objectName.
